tap "cmarquardt/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
cask "osxfuse"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# ANother Tool for Language Recognition
brew "antlr@2", link: true
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Asynchronous event library
brew "libevent"
# High performance message passing library
brew "open-mpi"
# Optimized BLAS library
brew "openblas"
# Routines to solve large scale eigenvalue problems
brew "arpack"
# Implementation of extended-Rice lossless compression algorithm
brew "szip"
# File format designed to store large amounts of data
brew "hdf5"
# C++ linear algebra library
brew "armadillo"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Parser generator
brew "bison"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# C access to FITS data files with optional Fortran wrappers
brew "cfitsio"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Standard SGML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Powerful wavelet image compressor
brew "epsilon"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Edit preview images and fix bounding boxes in EPS files
brew "epstool"
# XML 1.0 parser
brew "expat"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# Translates figures generated by xfig to other formats
brew "fig2dev"
# Library to extract data from Excel .xls files
brew "freexl"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# GNU awk utility
brew "gawk"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Graphics library to dynamically manipulate images
brew "gd"
# Geometry Engine
brew "geos"
# Library and utilities for processing GIFs
brew "giflib"
# JSON parser for C
brew "json-c"
# GNOME XML library
brew "libxml2"
# Framework for scientific data networking
brew "libdap"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Postgres C API library
brew "libpq"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Generic library support script
brew "libtool"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# Package for scientific computing with Python
brew "numpy", link: false
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Cross-platform application and UI framework
brew "qt"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Validating XML parser
brew "xerces-c"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Geospatial Data Abstraction Library
brew "gdal"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# AVH edition of git-flow
brew "git-flow-avh"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Incremental merge for git
brew "git-imerge"
# Git extension for versioning large files
brew "git-lfs"
# Tools for manipulating and plotting geographic and Cartesian data
brew "gmt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Numeric library for complex error functions
brew "libcerf"
# Powerful, lightweight programming language
brew "lua"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-driven, interactive function plotting
brew "gnuplot"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Numerical library for C and C++
brew "gsl"
# Source-code syntax highlighter
brew "source-highlight"
# GTK+ documentation tool
brew "gtk-doc"
# Database of common MIME types
brew "shared-mime-info"
# H.265/HEVC encoder
brew "x265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# High dynamic-range image file format
brew "openexr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Build automation system written for X11
brew "imake"
# Just Another Gibbs Sampler for Bayesian MCMC simulation
brew "jags"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Style and grammar checker
brew "languagetool"
# Sophisticated file transfer program
brew "lftp"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Allows SpatiaLite to support ST_MakeValid() like PostGIS
brew "liblwgeom"
# YAML Parser
brew "libyaml"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Data compression library
brew "lzlib"
# Creates dependencies in makefiles
brew "makedepend"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson", link: false
# Programs that partition graphs and order matrices
brew "metis"
# FTP client with an advanced user interface
brew "ncftp"
# Official documentation format of the GNU project
brew "texinfo"
# Unidata unit conversion library
brew "udunits"
# Command-line operators for netCDF and HDF files
brew "nco"
# Free/open-source library for nonlinear optimization
brew "nlopt"
# Platform built on V8 to build network applications
brew "node"
# Open-source coarray Fortran ABI, API, and compiler wrapper
brew "opencoarrays"
# Shell command parallelization utility
brew "parallel"
# C/C++ function library for exporting 2-D vector graphics
brew "plotutils"
# Library to work with the PDF file format
brew "podofo"
# Convert PostScript and PDF files to editable vector graphics
brew "pstoedit"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Python bindings for v5 of Qt
brew "pyqt"
# Computes convex hulls in n dimensions
brew "qhull"
# Fast updates of QR and Cholesky decompositions
brew "qrupdate"
# Port to Qt of the Scintilla editing component
brew "qscintilla2"
# Software environment for statistical computing
brew "r"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Software for mathematics, science, and engineering
brew "scipy", link: false
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# SQLite ODBC driver
brew "sqliteodbc"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Solve large, sparse nonsymmetric systems of equations
brew "superlu"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Data compression library with small memory footprint
brew "ucl"
# Compress/expand executable files
brew "upx"
# GNU Fortran compatibility for Apple's vecLib
brew "veclibfort"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# Interpreted, interactive, object-oriented programming language
brew "cmarquardt/formulae/python@2"
# Package for scientific computing with Python@2
brew "cmarquardt/formulae/numpy4python@2", link: false
# Decode and encode messages in the GRIB 1/2 and BUFR 3/4 formats, with netcdf, Python 2 interfaces and optional static libraries
brew "cmarquardt/formulae/eccodes-cm"
# EUMETSAT Polar System (EPS) data format library and python interface
brew "cmarquardt/formulae/eugene"
# Standards of Fundamental Astronomy (SOFA) library - C version
brew "cmarquardt/formulae/sofa"
# Standards of Fundamental Astronomy (SOFA) library - Fortran version
brew "cmarquardt/formulae/sofa-fortran"
cask "atom"
cask "sublime-text"
cask "textmate"
